Revit 2025 API
CellType Enumeration
 Declares the cell data type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CellType
Public Enumeration CellType
public enum class CellType
type CellType
Members
Member name | Value | Description
Text | 0 |  Simple text
Graphic | 1 |  Embedded graphic
Parameter | 2 |  Data bound parameter
Inherited | 3 |  the type is inherited from the column or section if appropriate
CombinedParameter | 4 |  The type is combined parameter
CalculatedValue | 5 |  The type is a calculated value
ParameterText | 6 |  Read only parameter which only show formatted string
CustomField | 7 |  Data bounded to a Schedule Custom Field.
See Also
Reference
Autodesk.Revit.DB Namespace